# Задача-1: Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

name = input("Enter your name: ")
age = int(input("Enter your age: "))
number = float(input("Enter any number: "))

print(name, age, number)
